Repository: inrae/ALAMODE-cuspy
Catalog: sphinx-doc/tm/cuspy-level1.tmx
Source language: en_gb
Languages: fr_fr

source: Parameter values that vary with time may be indicative of an inadequate model structure or of processes not taken into account.
fr_fr: Les valeurs des paramètres qui varient dans le temps peuvent indiquer une structure du modèle imparfaite ou l'existence de procès non pris en considération.

source: Parameters
fr_fr: Paramètres

source: Parametric uncertainty, due to the uncertainty about the value of model parameters.
fr_fr: Incertitude paramétrique, due à l'incertitude sur les valeurs des paramètres du modèle.

source: Path of the :file:`sweep_out.csv` file, created when making Monte Carlo simulations.
fr_fr: Chemin du fichier :file:`sweep_out.csv`, créé quand on réalise des simulations de Monte Carlo simulations.

source: Path of the modified pest file.
fr_fr: chemin du fichier pest modifié.

source: Path of the original pest file.
fr_fr: chemin du fichier pest originel.

source: Path of the parameter data file where the data will be written.
fr_fr: Chemin du fichier de données des paramètres où écrire les données.

source: Please note, though, that in this case the uncertainty is the uncertainty due to parametric uncertainty only and does not take into account measurement error or model inadequacies.
fr_fr: Veuillez noter, pourtant, que dans ce cas l'incertitude comprends seulement l'incertitude paramétrique et ne prend en compte les erreurs de mesure ou les imperfections du modèle.

source: Please, see the PEST++ user guide to obtain information on these files.
fr_fr: Veuillez voire le manuel d'utilisation de PEST++ pour vous renseigner sur ces fichiers.

source: Plus, the model must read the values of its parameters from a text file organised in two columns separated by spaces containing parameter names and values.
fr_fr: De plus, le modèle doit lire les valeurs des paramètres depuis un fichier texte organisé en deux colonnes séparées par des espaces et qui contiennent les noms des paramètres et leurs valeurs.

source: Posterior predictive error (error variance analysis)
fr_fr: Erreur prédictive a posteriori (analyse de la variance de l'erreur)

source: Posterior uncertainty
fr_fr: Incertitude a posteriori

source: Posterior uncertainty (Schur's complement analysis)
fr_fr: Incertitude a posteriori (analyse du complément de Schur)

source: Potential forecast error arising from model-to-measurement misfit (including measurement noise and structural noise).
fr_fr: Erreur potentielle de prédiction due à l'écart entre modèle et mesures (incluant l'erreur des mesures et l'erreur structurelle).

source: Potential forecast error arising from not calibrating all model parameters.
fr_fr: Erreur potentielle de prédiction due à la calibration seulement d'une partie des paramètres du modèle.

source: Potential forecast error arising from parameter uncertainty.
fr_fr: Erreur potentielle de prédiction due à l'incertitude des paramètres.

source: Practical or a posteriori unidentifiability: it corresponds to unidentifiability due to other sources than model structure, mainly forcing dataset and model and observation errors.
fr_fr: Manque d'identifiabilité pratique ou a posteriori : il correspond au manque d'identifiabilité dues à autres causes que la structure du modèle, principalement données de forçage et erreurs du modèle et des observations.

source: Predictive error
fr_fr: Erreur prédictive

source: Preferable when the model is not linear.
fr_fr: Préférable quand le modèle est non-linéaire.

source: Preliminary steps
fr_fr: Pas préliminaires

source: Preparation of the model
fr_fr: Préparation du modèle

source: Presentation
fr_fr: Présentation

source: Prior (before calibration) and posterior (after calibration) uncertainty analysis.
fr_fr: Analyse d'incertitudes a priori (avant calibration) et a posteriori (après calibration).

source: Prior linear uncertainty analysis.
fr_fr: Analyse linéaire d'incertitudes a priori.

source: Prior uncertainty
fr_fr: Incertitude a priori

source: Process file :file:`sweep_out.csv`.
fr_fr: Traite le fichier :file:`sweep_out.csv`.

source: Project-Id-Version: cuspy Report-Msgid-Bugs-To: POT-Creation-Date: 2022-07-07 12:29+0200 PO-Revision-Date: YEAR-MO-DA HO:MI+ZONE Last-Translator: FULL NAME <EMAIL@ADDRESS> Language-Team: LANGUAGE <LL@li.org> MIME-Version: 1.0 Content-Type: text/plain; charset=utf-8 Content-Transfer-Encoding: 8bit Generated-By: Babel 2.9.1
fr_fr: Project-Id-Version: cuspy Report-Msgid-Bugs-To: POT-Creation-Date: 2022-07-07 12:29+0200 PO-Revision-Date: YEAR-MO-DA HO:MI+ZONE Last-Translator: FULL NAME <EMAIL@ADDRESS> Language-Team: LANGUAGE <LL@li.org> MIME-Version: 1.0 Content-Type: text/plain; charset=utf-8 Content-Transfer-Encoding: 8bit Generated-By: Babel 2.8.0

source: Python code
fr_fr: Code Python

source: Python module
fr_fr: Module Python

source: Quantification of uncertainty
fr_fr: Quantification de l'incertitude

source: Quantitative reproduction of the behaviour of a system ahead of time, but given observations of the inputs, state variables, and outputs up to the forecast origin.
fr_fr: Reproduction quantitative du comportement d'un système à l'avance, mais avec des observations des entrées, variables d'état, et sorties jusqu'au départ de la prédiction.

source: Quantitative reproduction of the behaviour of a system, given some defined inputs but without reference to any observed outputs.
fr_fr: Reproduction quantitative du comportement d'un système, données quelques entrées mais sans faire référence à aucun retour observé.

source: Reassessment of the model's aim, scale and scope.
fr_fr: Réanalyse de l'objet, échelle et portée du modèle.

source: Reduction of parameter uncertainty by calibration
fr_fr: Réduction de l'incertitude des paramètres par calibration

source: References
fr_fr: Références

source: Returns
fr_fr: Retour

source: Run time calculations are based on the cases presented in the :file:`tests` folder and were made using an Ubuntu virtual machine with 4 processors of 3067 MHz.
fr_fr: Les valeurs de temps de calcul sont basées sur les cas du dossier :file:`tests` et ont été obtenues pour une machine virtuelle Ubuntu avec 4 processeurs de 3067 MHz.

source: Schur's complement analysis for conditional uncertainty propagation.
fr_fr: Analyse du complément de Schur pour la propagation d'incertitude conditionnelle.

source: Schur's complement analysis is valid when the model has linear (or almost linear) response to variations in the value of the parameters.
fr_fr: L'analyse du complément de Schur est valide quand le modèle a une réponse linéaire (ou presque linéaire) aux variations de la valeur des paramètres.

source: Select data subsets for calibration and validation.
fr_fr: Sélection de sous-ensembles de données pour la calibration et pour la validation.

source: Select metrics, such as RMSE and :math:`r^2`, to measure model performance.
fr_fr: Il faut choisir des métriques, telles que le RMSE et :math:`r^2`, pour mesurer la performance du modèle.

source: Selection of basic performance criteria.
fr_fr: Sélection de critères basiques de performance.

source: Selection of model features
fr_fr: Sélection des caractéristiques du modèle

source: Selection of the performance criteria and algorithm
fr_fr: Sélection des critères de performance et algorithmes

source: Sensitivity analysis
fr_fr: Analyse de sensitivité

source: Sensitivity analysis and uncertainty analysis
fr_fr: Analyse de sensitivité et analyse d'incertitudes

source: Sensitivity analysis may be used to answer the following questions (Hall et al.
fr_fr: L'analyse de sensitivité peut être utilisé pour répondre aux questions suivantes (Hall et al. :

source: Sensitivity analysis, instead, consists in assessing how variations in the model inputs, individually or in combination, influence the variation in the model outputs.
fr_fr: L'analyse de sensitivité, par contre, consiste en l'évaluation de comment les variations des entrées su modèle, individuellement ou en combinaison, influencent la variation des sorties du modèle.

source: Sensitivity analysis.
fr_fr: Analyse de sensitivité

source: Sensitivity of model parameters (Sobol method, 400 samples)
fr_fr: Sensitivité des paramètres du modèle (méthode de Sobol, 400 échantillons)

source: Several scripts that use these data and model are also available in the folder :file:`tests`.
fr_fr: Plusieurs scripts qu'utilisent ces données et modèle sont disponibles aussi dans le dossier :file:`tests`.

source: Should we vary slightly our modelling assumptions and the input data, the predicted behaviour would also vary.
fr_fr: Si on varie légèrement les présuppositions du modèle et des données d'entrée, le comportement prédit variera aussi.

source: Similarly, you can obtain information on the reduction of parameter uncertainty through calibration by typing:
fr_fr: De façon similaire, vous pouvez obtenir information sur la réduction de l'incertitude des paramètres par la calibration si vous tapez :

source: Simulation of the future behaviour of a system given prior assumptions about future input data.
fr_fr: Simulation du comportement future d'un système depuis des suppositions a priori sur les données d'entrée futures.

source: Since SRCs are calculated over a range of values they may be considered as global sensitivity indices.
fr_fr: Du moment où les SRCs sont calculés sur un rang de valeurs ils peuvent être considérés comme des indices de sensitivité globaux.

source: Since our knowledge of the system behaviour is incomplete, our implementation of the system processes is not perfect.
fr_fr: Comme notre connaissance du comportement du système est incomplète, notre implémentation des procès du système ne sera parfaite non plus.

source: Since there is a great uncertainty on the value of the parameters, we will use Differential Evolution (DE) to make a first calibration.
fr_fr: Comme il y a une grande incertitude par rapport à la valeur des paramètres, nous utiliserons la méthode d'Évolution Différentielle (DE) pour faire une première calibration.

source: Sobol's method (all parameters vary at the same time).
fr_fr: Méthode de Sobol (tous les paramètres varient au même temps).

source: Solving this issue would require collecting data for different experimental or environmental conditions.
fr_fr: Pour résoudre ce problème il faudrait collecter des données sous différentes conditions expérimentales ou environnementales.

source: Some examples:
fr_fr: Quelques exemples :

source: Some help documents have been written using markdown (README.md, DISCLAIMER.md).
fr_fr: Quelques documents d'aide ont été écrits en format markdown (README.md, DISCLAIMER.md).

source: Some more sophisticated techniques try to address the equifinality problem.
fr_fr: Quelques techniques plus sophistiquées essayent d'affronter le problème de l'equifinalité.

source: Some of the previous analyses are based on the use of linear uncertainty methods.
fr_fr: Quelques uns des analyses précédents sont basés sur l'utilisation de méthodes linéaires d'analyse de l'incertitude.

source: Sources of unidentifiability
fr_fr: Sources de la manque d'identifiabilité

source: Specification of the modelling context: scope and resources
fr_fr: Spécification du contexte de modélisation : portée et ressources

source: Sphinx also extracts data from the project modules docstrings.
fr_fr: Sphinx extrait aussi des données des docstrings des modules du projet.

source: Still, Doherty & Welter (2010) recommend using multiple-component objective functions as a way of reducing the influence of model structural error on the calibration.
fr_fr: Cependant, Doherty & Welter (2010) recommandent d'utiliser des fonctions d'objectifs multiples comme à moyen pour réduire l'influence de l'erreur structurale du modèle sur la calibration.

source: Still, the design of the package is sufficiently general to be quite model-independent.
fr_fr: De toute façon, le design du paquet est suffisamment général pour être assez indépendant du modèle.

source: Structural identifiability can be assessed by analysing the model's equations.
fr_fr: L'identifiabilité structurale peut être évaluée par l'analyse des équations du modèle.

source: Structural or a priori unidentifiability.
fr_fr: Manque d'identifiabilité structurale ou a priori.

source: Structural uncertainty, due to the uncertainty in the structure of the model.
fr_fr: Incertitude structurale, due à l'incertitude dans la structure du modèle.

source: Structural unidentifiability implies practical unidentifiability.
fr_fr: Le manque d'identifiabilité structurale implique un manque d'identifiabilité pratique.

source: Such methods allow analysing the effect of parametric uncertainty as shown above (see `Prior uncertainty`_).
fr_fr: Ces méthodes permettent d'analyser l'effet de l'incertitude paramétrique comme on a vu dessus (voir `Incertitude a priori`_).

source: The :class:`ErrVar` object returned by the function :func:`linear_uncertainty` allows to access the results of the error variance analysis:
fr_fr: L'objet :class:`ErrVar` retourné par la fonction :func:`linear_uncertainty` peut être utilisé pour accéder aux résultats de l'analyse de la variance de l'erreur :

source: The :class:`LinearAnalysis` object returned by the function can be used to access the results of the uncertainty analysis.
fr_fr: L'objet :class:`LinearAnalysis` retourné par la fonction peut être utilisé pour accéder aux résultats de l'analyse d'incertitudes.

source: The :mod:`cuspy` package can be applied to a large class of models, on the condition that:
fr_fr: Le paquet :mod:`cuspy` peut être appliqué à une large variété de modèles, à condition que :

source: The :mod:`cuspy` package is originally written in English and translated into French.
fr_fr: Le package :mod:`cuspy` a été écrit originalement en anglais et traduit au français.

source: The GLUE method is not implemented in this package, but it can be applied easily by properly treating the output of the :func:`monte_carlo` function.
fr_fr: La méthode GLUE n'est pas implémentée dans ce paquet, mais peut être appliquée facilement par un traitement approprié du retour de la fonction :func:`monte_carlo`.

source: The IES method can be configured with the `pestpp_opts` argument.
fr_fr: La méthode IES peut être configurée avec l'argument `pestpp_opts`.

source: The PEST control file (``pst_file``)
fr_fr: Le fichier de contrôle (``pst_file``)

source: The PEST control file contains all the information necessary to control the execution of the PEST++ executables.
fr_fr: Le fichier de contrôle PEST contient toute l'information nécessaire pour contrôler l'exécution des exécutables de PEST++.

source: The PEST++ executables and uses are:
fr_fr: Les exécutables de PEST++ et leurs utilisations sont :

source: The PEST++ executables are: "pestpp-glm", "pestpp-sen", "pestpp-opt", "pestpp-ies" and "pestpp-swp".
fr_fr: Les exécutables de PEST++ sont: "pestpp-glm", "pestpp-sen", "pestpp-opt", "pestpp-ies" et "pestpp-swp".

source: The ``ins_file`` is a file indicating PEST++ which values in the ``output_file`` correspond to observations and predictions.
fr_fr: Le ``ins_file`` est un fichier qui indique à PEST++ quelles valeurs du fichier ``output_file`` correspondent aux observations et quelles aux prédictions.

source: The ``pst_file`` controls the execution of the PEST++ executables.
fr_fr: Le ``pst_file`` contrôle l'exécution des exécutables de PEST++.

source: The ``tpl_file`` is a template of the parameter file ``par_file`` used by PEST++ to modify it.
fr_fr: Le fichier ``tpl_file`` est un fichier modèle du fichier de paramètres ``par_file`` utilisé par PEST++ pour le modifier.

source: The absolute validation and verification of numerical models is impossible for epistemic reasons (Oreskes et al.
fr_fr: La validation et vérification absolues des modèles numériques est impossible pour des raisons épistémiques (Oreskes et al.

source: The address may vary depending on whether you install it for one or all users (e.g., :file:`%USERPROFILE%/AppData/roaming/Python/Python37/scripts` or :file:`C:/Users/MyUserName/AppData/Local/Programs/Python/Python37/Scripts`).
fr_fr: L'adresse peut varier en fonction de si vous l'installez pour un ou plusieurs utilisateurs (p. ex., :file:`%USERPROFILE%/AppData/roaming/Python/Python37/scripts` ou :file:`C:/Users/MyUserName/AppData/Local/Programs/Python/Python37/Scripts`).

source: The application :mod:`cuspy` depends on the Python packages :mod:`numpy`, :mod:`pandas` and :mod:`pyemu`.
fr_fr: Le logiciel :mod:`cuspy` dépend des paquets Python :mod:`numpy`, :mod:`pandas` et :mod:`pyemu`.

source: The application of such methods to nonlinear models provides approximate results only.
fr_fr: L'application de telles méthodes à de modèles non-linéaires donne seulement des résultats approximés.

source: The available data and measurements of the system state are limited and they are a partial representation of the studied system.
fr_fr: Les données disponibles et les mesures de l'état du système sont limitées et elles sont une représentation partielle du système étudié.

source: The comparison of simulations to observations or expectations is known as model evaluation and can take several forms.
fr_fr: La comparaison des simulations aux observations ou résultats espérés est connue comme évaluation du modèle et peut prendre plusieurs formes.

source: The compiled executables can then be found in the folder :file:`pestpp/bin/linux`.
fr_fr: Les exécutables compilés se trouvent alors dans le dossier :file:`pestpp/bin/linux`.

source: The data
fr_fr: Les données

source: The data covers the period 1999-2015.
fr_fr: Les données recouvrent la période 1999-2015.

source: The data for the linear regression can be obtained from Monte Carlo runs.
fr_fr: Les données pour la régression linéaire peut être obtenue à partir de simulations de Monte Carlo.

source: The documentation in French is saved in the folder :file:`build_fr`.
fr_fr: La documentation en français est sauvegardée dans le dossier :file:`build_fr`.

source: The documentation translated into French has been created using :mod:`sphinx-intl`.
fr_fr: La documentation traduite en français a été créé avec :mod:`sphinx-intl`.

source: The ensemble of optimized sets can be considered as a sampling of the posterior distribution.
fr_fr: L'ensemble des ensembles optimisés peut être considéré comme un échantillon de la distribution a posteriori.

source: The error variance analysis uses singular value decomposition (SVD) to estimate the effective dimensionality of the system and different criteria have been proposed to choose how many singular values should be used:
fr_fr: L'analyse de la variance de l'erreur utilise la décomposition en valeurs singulières (DVS) pour estimer la dimensionnalité effective du système et plusieurs critères ont été proposés pour choisir combien de valeurs singulières il faudrait utiliser :

source: The existence of flat surfaces indicates unidentifiability, while different peaks with equal objective function values are indicative of local identifiability.
fr_fr: L'existence de surfaces plates indique manque d'identifiabilité, alors que différents pics avec valeurs pareilles de la fonction d'objectifs indiquent identifiabilité locale.

source: The figure shows visually that there is a large uncertainty in the value of the parameters :math:`\alpha` and :math:`\beta`, which determine, respectively, the upper asymptote and the inflexion point of the logistic curve.
fr_fr: La figure montre visuellement qu'il y a une grande incertitude dans la valeur des paramètres :math:`\alpha` et :math:`\beta`, qui déterminent, respectivement, l'asymptote supérieure et le point d'inflexion point de la courbe logistique.

source: The file is organised in two columns, the first containing keys, and the second one containing values.
fr_fr: Le fichier est organisé en deux colonnes, la première contient les clés et la seconde contient les valeurs.

source: The file is written according to the PEST matrix file specifications.
fr_fr: Le fichier est écrit d'après les spécifications du fichier de matrice de PEST.

source: The files :file:`obs.txt` and :file:`pred.txt` contain observations or measurements.
fr_fr: Les fichiers :file:`obs.txt` et :file:`pred.txt` contiennent des observations ou mesures.

source: The first column contains dates in the format "YYYY-mm-dd".
fr_fr: La première colonne contient les dates avec le format "AAAA-mm-jj".

source: The first line of the file contains the column names, described below:
fr_fr: La première ligne du fichier contient les noms des colonnes, décrits ci-dessous :

source: The first order sensitivity index :math:`S_i` measures the proportion of the variance of the model output that is explained by each parameter (without interactions).
fr_fr: L'index de sensitivité de premier ordre :math:`S_i` mesure la proportion de la variance du retour du modèle qu'est expliquée par chaque paramètre individuellement (sans interactions).

source: The first stage in the use of the :mod:`cuspy` package is the creation of the PEST files.
fr_fr: Le premier étage dans l'utilisation du paquet :mod:`cuspy` est la création des fichiers PEST.

source: The folder :file:`tests` contains several scripts that can be used to test the package functionalities.
fr_fr: Le dossier :file:`tests` contient plusieurs scripts permettant de tester les fonctionnalités du paquet.

source: The folder also contains three files containing observation names (:file:`obs_names.txt`), observation group names (:file:`obs_groups.txt`) and observation weights (:file:`obs_weights.txt`).
fr_fr: Dans le dossier il y a aussi trois fichiers qui contiennent les noms des observations (:file:`obs_names.txt`), les noms des groupes d'observations (:file:`obs_groups.txt`) et les poids des observations (:file:`obs_weights.txt`).

source: The following figure shows temperature measurements taken in 2015, superimposed on simulations and predictive uncertainty for all days in the same year.
fr_fr: La figure suivante montre les mesures de température prises en 2015, surimposées aux simulations et à l'incertitude prédictive pour tous les jours dans la même année.

source: The following figure shows the 400 random realizations used to calculate Sobol indexes superimposed on measurements.
fr_fr: La figure suivante montre les 400 réalisations aléatoires utilisées pour calculer les indexes de Sobol surimposées aux mesures.

source: The following figure shows the percent reduction in uncertainty by parameter and forecast date.
fr_fr: La figure suivante montre le pourcentage de réduction de l'incertitude par paramètre et date de la prédiction.

source: The following instructions return the variance of the predictions after adding a new observation or group of observations:
fr_fr: Les instructions suivantes retournent la variance des prédictions après l'ajout d'une nouvelle observation ou groupe d'observations :

source: The following is an example of the instruction to create the PEST files for the OKP model.
fr_fr: Le suivant est un exemple de la commande pour créer les fichiers PEST pour le modèle OKP.

source: The following options are available:
fr_fr: Les options suivantes sont disponibles :

source: The following table shows the computational cost of several :mod:`cuspy` functions in terms of number of model runs and run time.
fr_fr: La table suivante montre le coût computationnel de plusieurs fonctions de :mod:`cuspy` en nombre d'exécutions du modèle et de temps de calcul.

source: The following table shows the reduction in parameter uncertainty through calibration according to Schur's complement analysis.
fr_fr: La table suivante montre la réduction d'incertitude des paramètres produite par la calibration d'après l'analyse du complément de Schur.
